## SQL

In [1]:
import sqlite3

In [2]:
# Connect to the SQLite database (or create it if it doesn't exist)
conn = sqlite3.connect('my_database.db')
cursor = conn.cursor()

In [3]:
%load_ext sql
%sql sqlite:///my_database.db

Connecting to 'sqlite:///my_database.db'

In [4]:
# Delete all tables from the database. This is useful when rerunning the notebook.

In [5]:
# Get all user-defined tables (excluding internal SQLite tables)
cursor.execute("SELECT name FROM sqlite_master WHERE type='table' AND name NOT LIKE 'sqlite_%';")
tables = cursor.fetchall()

# Drop each table
for table in tables:
    cursor.execute(f"DROP TABLE IF EXISTS {table[0]};")

In [6]:
# Read the tables
table_list = ['assignment_history SQL Table.txt', 'bookings SQL Table.txt', 'space_travel_agents SQL Table.txt']

for t in table_list:
    with open(t, 'r') as f:
        script = f.read()
    cursor.executescript(script)

In [7]:
## Merge table bookings and assignment_history so that bookings have information of AgentID

In [8]:
%%sql

CREATE TABLE bookings_2 AS
SELECT B.*,
        AH.AgentID
FROM bookings AS B
LEFT JOIN assignment_history AS AH USING(AssignmentID)

Running query in 'sqlite:///my_database.db'

++
||
++
++

In [9]:
%sql SELECT * FROM bookings_2 LIMIT 1

Running query in 'sqlite:///my_database.db'

+-----------+--------------+---------------------+---------------+-------------+------------------+----------------------------------+--------------------+----------------+--------------+---------------+---------+
| BookingID | AssignmentID | BookingCompleteDate | CancelledDate | Destination |     Package      |          LaunchLocation          | DestinationRevenue | PackageRevenue | TotalRevenue | BookingStatus | AgentID |
+-----------+--------------+---------------------+---------------+-------------+------------------+----------------------------------+--------------------+----------------+--------------+---------------+---------+
|     1     |      1       | 2081-02-01 10:00:00 |      None     |     Mars    | Luxury Dome Stay | Dallas-Fort Worth Launch Complex |       150000       |     25000      |    175000    |   Confirmed   |    7    |
+-----------+--------------+---------------------+---------------+-------------+------------------+----------------------------------+--------------------+----------------+--------------+---------------+---------+

## Create another column for table space_travel_agents, named 'load'. This gives an update on available agents

In [10]:
%%sql 

ALTER TABLE space_travel_agents
ADD COLUMN load INTEGER DEFAULT 0;

ALTER TABLE space_travel_agents
ADD COLUMN agent_rank INTEGER;

Running query in 'sqlite:///my_database.db'

++
||
++
++

## Update the load from bookings table and agent_rank from space_travel_agents

In [11]:
%%sql
UPDATE space_travel_agents
SET load = load + (
  SELECT COUNT(*)
  FROM bookings_2
  WHERE bookings_2.AgentID = space_travel_agents.AgentID
    AND bookings_2.BookingStatus = 'Pending'
)

Running query in 'sqlite:///my_database.db'

30 rows affected.

++
||
++
++

In [12]:
## Update agent_rank list

In [13]:
%%sql

UPDATE space_travel_agents
SET agent_rank = (
  SELECT COUNT(*)
  FROM space_travel_agents AS b
  WHERE b.load < space_travel_agents.load
     OR (b.load = space_travel_agents.load AND b.YearsOfService > space_travel_agents.YearsOfService)
     OR (b.load = space_travel_agents.load AND b.YearsOfService = space_travel_agents.YearsOfService AND b.AverageCustomerServiceRating > space_travel_agents.AverageCustomerServiceRating)
) + 1;

Running query in 'sqlite:///my_database.db'

30 rows affected.

++
||
++
++

In [14]:
%sql SELECT * FROM space_travel_agents LIMIT 5

Running query in 'sqlite:///my_database.db'

+---------+-----------+-----------+-----------------------------+---------------------------+----------------------+---------------+--------------------+----------------+------------------------------+------+------------+
| AgentID | FirstName |  LastName |            Email            |          JobTitle         |    DepartmentName    |  ManagerName  | SpaceLicenseNumber | YearsOfService | AverageCustomerServiceRating | load | agent_rank |
+---------+-----------+-----------+-----------------------------+---------------------------+----------------------+---------------+--------------------+----------------+------------------------------+------+------------+
|    1    |   Aurora  |   Tanaka  | aurora.tanaka@astra2081.com | Senior Space Travel Agent | Interplanetary Sales |   Lyra Chen   |    SL-2081-001     |       12       |             4.0              |  0   |     5      |
|    2    |    Kai    | Rodriguez | kai.rodriguez@astra2081.com |     Space Travel Agent    |    Luxury Voyages    |   Lyra Chen   |    SL-2081-002     |       7        |             4.0              |  1   |     21     |
|    3    |    Nova   |   Singh   |   nova.singh@astra2081.com  | Senior Space Travel Agent |   Premium Bookings   | Zane Holloway |    SL-2081-003     |       15       |             4.0              |  0   |     2      |
|    4    |    Leo    |    Kim    |    leo.kim@astra2081.com    |     Space Travel Agent    | Interplanetary Sales |   Lyra Chen   |    SL-2081-004     |       5        |             4.0              |  0   |     10     |
|    5    |    Vera   |   Nguyen  |  vera.nguyen@astra2081.com  |     Space Travel Agent    |    Luxury Voyages    | Zane Holloway |    SL-2081-005     |       3        |             3.9              |  1   |     24     |
+---------+-----------+-----------+-----------------------------+---------------------------+----------------------+---------------+--------------------+----------------+------------------------------+------+------------+

## Create trigger to update loads

In [15]:
%%sql
    
CREATE TRIGGER update_agent_load_subtracting
AFTER UPDATE OF BookingStatus ON bookings_2
BEGIN
    -- Update agent load
    UPDATE space_travel_agents
    SET load = CASE
        WHEN load > 0 THEN load - 1
        ELSE 0
    END
    WHERE AgentID = NEW.AgentID
    AND OLD.BookingStatus = 'Pending'
    AND NEW.BookingStatus IN ('Confirmed', 'Rejected');

END;

Running query in 'sqlite:///my_database.db'

++
||
++
++

In [16]:
%%sql
    
CREATE TRIGGER update_agent_load_adding
AFTER INSERT ON bookings_2
FOR EACH ROW
BEGIN

    UPDATE space_travel_agents
    SET load = load + 1
    WHERE AgentID = NEW.AgentID
    AND NEW.BookingStatus = 'Pending';

END;

Running query in 'sqlite:///my_database.db'

++
||
++
++

In [17]:
## Create agent_rank based on load, YearsOfService, and AverageCustomerServiceRating

## Create trigger to update agent_rank

In [18]:
%%sql

CREATE TABLE IF NOT EXISTS agent_rank_tracker (
  AgentID INTEGER PRIMARY KEY,
  agent_rank INTEGER 
);

Running query in 'sqlite:///my_database.db'

++
||
++
++

In [19]:
## Create procedure for agent_rank

In [20]:
%%sql

CREATE TRIGGER update_agent_rank
AFTER UPDATE OF load ON space_travel_agents
FOR EACH ROW
BEGIN
  -- Step 1: Clear and rebuild tracker
  DELETE FROM agent_rank_tracker;

  INSERT INTO agent_rank_tracker (AgentID, agent_rank)
  SELECT a.AgentID,
         (
           SELECT COUNT(*)
           FROM space_travel_agents AS b
           WHERE b.load < a.load
              OR (b.load = a.load AND b.YearsOfService > a.YearsOfService)
              OR (b.load = a.load AND b.YearsOfService = a.YearsOfService AND b.AverageCustomerServiceRating > a.AverageCustomerServiceRating)
         ) + 1
  FROM space_travel_agents AS a;

  -- Step 2: Update space_travel_agents using a correlated subquery
  UPDATE space_travel_agents
  SET agent_rank = (
    SELECT agent_rank
    FROM agent_rank_tracker
    WHERE agent_rank_tracker.AgentID = space_travel_agents.AgentID
  )
  WHERE AgentID IN (
    SELECT AgentID FROM agent_rank_tracker
  );
END;

Running query in 'sqlite:///my_database.db'

++
||
++
++

In [21]:
%%sql

CREATE TRIGGER update_agent_rank_2
AFTER INSERT ON bookings_2
FOR EACH ROW
BEGIN
  -- Step 1: Clear and rebuild tracker
  DELETE FROM agent_rank_tracker;

  INSERT INTO agent_rank_tracker (AgentID, agent_rank)
  SELECT a.AgentID,
         (
           SELECT COUNT(*)
           FROM space_travel_agents AS b
           WHERE b.load < a.load
              OR (b.load = a.load AND b.YearsOfService > a.YearsOfService)
              OR (b.load = a.load AND b.YearsOfService = a.YearsOfService AND b.AverageCustomerServiceRating > a.AverageCustomerServiceRating)
         ) + 1
  FROM space_travel_agents AS a;

  -- Step 2: Update space_travel_agents using a correlated subquery
  UPDATE space_travel_agents
  SET agent_rank = (
    SELECT agent_rank
    FROM agent_rank_tracker
    WHERE agent_rank_tracker.AgentID = space_travel_agents.AgentID
  )
  WHERE AgentID IN (
    SELECT AgentID FROM agent_rank_tracker
  );
END;

Running query in 'sqlite:///my_database.db'

++
||
++
++

In [22]:
%%sql

CREATE TRIGGER update_agent_rank_3
AFTER INSERT ON assignment_history
FOR EACH ROW
BEGIN
  -- Step 1: Clear and rebuild tracker
  DELETE FROM agent_rank_tracker;

  INSERT INTO agent_rank_tracker (AgentID, agent_rank)
  SELECT a.AgentID,
         (
           SELECT COUNT(*)
           FROM space_travel_agents AS b
           WHERE b.load < a.load
              OR (b.load = a.load AND b.YearsOfService > a.YearsOfService)
              OR (b.load = a.load AND b.YearsOfService = a.YearsOfService AND b.AverageCustomerServiceRating > a.AverageCustomerServiceRating)
         ) + 1
  FROM space_travel_agents AS a;

  -- Step 2: Update space_travel_agents using a correlated subquery
  UPDATE space_travel_agents
  SET agent_rank = (
    SELECT agent_rank
    FROM agent_rank_tracker
    WHERE agent_rank_tracker.AgentID = space_travel_agents.AgentID
  )
  WHERE AgentID IN (
    SELECT AgentID FROM agent_rank_tracker
  );
END;

Running query in 'sqlite:///my_database.db'

++
||
++
++

## Create another trigger when new row of 'Pending' was created. Only increase load if the new booking is 'Pending'

In [23]:
%sql SELECT * FROM space_travel_agents LIMIT 5

Running query in 'sqlite:///my_database.db'

+---------+-----------+-----------+-----------------------------+---------------------------+----------------------+---------------+--------------------+----------------+------------------------------+------+------------+
| AgentID | FirstName |  LastName |            Email            |          JobTitle         |    DepartmentName    |  ManagerName  | SpaceLicenseNumber | YearsOfService | AverageCustomerServiceRating | load | agent_rank |
+---------+-----------+-----------+-----------------------------+---------------------------+----------------------+---------------+--------------------+----------------+------------------------------+------+------------+
|    1    |   Aurora  |   Tanaka  | aurora.tanaka@astra2081.com | Senior Space Travel Agent | Interplanetary Sales |   Lyra Chen   |    SL-2081-001     |       12       |             4.0              |  0   |     5      |
|    2    |    Kai    | Rodriguez | kai.rodriguez@astra2081.com |     Space Travel Agent    |    Luxury Voyages    |   Lyra Chen   |    SL-2081-002     |       7        |             4.0              |  1   |     21     |
|    3    |    Nova   |   Singh   |   nova.singh@astra2081.com  | Senior Space Travel Agent |   Premium Bookings   | Zane Holloway |    SL-2081-003     |       15       |             4.0              |  0   |     2      |
|    4    |    Leo    |    Kim    |    leo.kim@astra2081.com    |     Space Travel Agent    | Interplanetary Sales |   Lyra Chen   |    SL-2081-004     |       5        |             4.0              |  0   |     10     |
|    5    |    Vera   |   Nguyen  |  vera.nguyen@astra2081.com  |     Space Travel Agent    |    Luxury Voyages    | Zane Holloway |    SL-2081-005     |       3        |             3.9              |  1   |     24     |
+---------+-----------+-----------+-----------------------------+---------------------------+----------------------+---------------+--------------------+----------------+------------------------------+------+------------+

# Test trigger: agentID = 1 currently has load of 0 and agentID = 2 currently has load of 1

In [24]:
%%sql
SELECT * 
FROM bookings_2
WHERE AgentID = 2 AND BookingStatus = 'Pending'

Running query in 'sqlite:///my_database.db'

+-----------+--------------+---------------------+---------------+-------------+-----------------+--------------------------+--------------------+----------------+--------------+---------------+---------+
| BookingID | AssignmentID | BookingCompleteDate | CancelledDate | Destination |     Package     |      LaunchLocation      | DestinationRevenue | PackageRevenue | TotalRevenue | BookingStatus | AgentID |
+-----------+--------------+---------------------+---------------+-------------+-----------------+--------------------------+--------------------+----------------+--------------+---------------+---------+
|    351    |     389      |         None        |      None     |    Titan    | Ringside Cruise | New York Orbital Gateway |       140000       |     20000      |    160000    |    Pending    |    2    |
+-----------+--------------+---------------------+---------------+-------------+-----------------+--------------------------+--------------------+----------------+--------------+---------------+---------+

In [25]:
# Change BookingStatus to Confirmed bookingID = 351

In [26]:
%%sql
UPDATE bookings_2 
SET BookingStatus = 'Confirmed'
WHERE BookingID = 351

Running query in 'sqlite:///my_database.db'

1 rows affected.

++
||
++
++

In [27]:
%sql SELECT * FROM space_travel_agents LIMIT 5

Running query in 'sqlite:///my_database.db'

+---------+-----------+-----------+-----------------------------+---------------------------+----------------------+---------------+--------------------+----------------+------------------------------+------+------------+
| AgentID | FirstName |  LastName |            Email            |          JobTitle         |    DepartmentName    |  ManagerName  | SpaceLicenseNumber | YearsOfService | AverageCustomerServiceRating | load | agent_rank |
+---------+-----------+-----------+-----------------------------+---------------------------+----------------------+---------------+--------------------+----------------+------------------------------+------+------------+
|    1    |   Aurora  |   Tanaka  | aurora.tanaka@astra2081.com | Senior Space Travel Agent | Interplanetary Sales |   Lyra Chen   |    SL-2081-001     |       12       |             4.0              |  0   |     5      |
|    2    |    Kai    | Rodriguez | kai.rodriguez@astra2081.com |     Space Travel Agent    |    Luxury Voyages    |   Lyra Chen   |    SL-2081-002     |       7        |             4.0              |  0   |     8      |
|    3    |    Nova   |   Singh   |   nova.singh@astra2081.com  | Senior Space Travel Agent |   Premium Bookings   | Zane Holloway |    SL-2081-003     |       15       |             4.0              |  0   |     2      |
|    4    |    Leo    |    Kim    |    leo.kim@astra2081.com    |     Space Travel Agent    | Interplanetary Sales |   Lyra Chen   |    SL-2081-004     |       5        |             4.0              |  0   |     11     |
|    5    |    Vera   |   Nguyen  |  vera.nguyen@astra2081.com  |     Space Travel Agent    |    Luxury Voyages    | Zane Holloway |    SL-2081-005     |       3        |             3.9              |  1   |     24     |
+---------+-----------+-----------+-----------------------------+---------------------------+----------------------+---------------+--------------------+----------------+------------------------------+------+------------+

AgentID = 2 improves ranking after completing one "Pending" request.

In [28]:
%sql SELECT * FROM agent_rank_tracker LIMIT 5

Running query in 'sqlite:///my_database.db'

+---------+------------+
| AgentID | agent_rank |
+---------+------------+
|    1    |     5      |
|    2    |     8      |
|    3    |     2      |
|    4    |     11     |
|    5    |     24     |
+---------+------------+

In [29]:
%sql SELECT * FROM space_travel_agents ORDER BY agent_rank LIMIT 3

Running query in 'sqlite:///my_database.db'

+---------+-----------+----------+---------------------------+---------------------------+------------------+---------------+--------------------+----------------+------------------------------+------+------------+
| AgentID | FirstName | LastName |           Email           |          JobTitle         |  DepartmentName  |  ManagerName  | SpaceLicenseNumber | YearsOfService | AverageCustomerServiceRating | load | agent_rank |
+---------+-----------+----------+---------------------------+---------------------------+------------------+---------------+--------------------+----------------+------------------------------+------+------------+
|    6    |   Soren   |  Baker   | soren.baker@astra2081.com |  Lead Space Travel Agent  | Premium Bookings | Zane Holloway |    SL-2081-006     |       18       |             4.6              |  0   |     1      |
|    3    |    Nova   |  Singh   |  nova.singh@astra2081.com | Senior Space Travel Agent | Premium Bookings | Zane Holloway |    SL-2081-003     |       15       |             4.0              |  0   |     2      |
|    27   |   Ronan   |  Young   | ronan.young@astra2081.com | Senior Space Travel Agent | Premium Bookings | Zane Holloway |    SL-2081-027     |       15       |             4.0              |  0   |     2      |
+---------+-----------+----------+---------------------------+---------------------------+------------------+---------------+--------------------+----------------+------------------------------+------+------------+

In [30]:
## Test for trigger bu adding another row to the table

In [31]:
%%sql
INSERT INTO bookings_2 (BookingID, AssignmentID, AgentID, BookingStatus)
VALUES (500, 500, 1, 'Pending'),
       (501, 501, 1, 'Pending');

SELECT * FROM bookings_2 ORDER BY BookingID DESC LIMIT 5

Running query in 'sqlite:///my_database.db'

2 rows affected.

+-----------+--------------+---------------------+---------------+-------------+------------------------+----------------------------------+--------------------+----------------+--------------+---------------+---------+
| BookingID | AssignmentID | BookingCompleteDate | CancelledDate | Destination |        Package         |          LaunchLocation          | DestinationRevenue | PackageRevenue | TotalRevenue | BookingStatus | AgentID |
+-----------+--------------+---------------------+---------------+-------------+------------------------+----------------------------------+--------------------+----------------+--------------+---------------+---------+
|    501    |     501      |         None        |      None     |     None    |          None          |               None               |        None        |      None      |     None     |    Pending    |    1    |
|    500    |     500      |         None        |      None     |     None    |          None          |               None               |        None        |      None      |     None     |    Pending    |    1    |
|    412    |     450      | 2081-04-10 14:25:00 |      None     |    Europa   | Glacier Trek Adventure |     Tokyo Spaceport Terminal     |       120000       |     25000      |    145000    |   Confirmed   |    11   |
|    411    |     449      | 2081-04-10 14:25:00 |      None     |    Titan    |    Ringside Cruise     |     New York Orbital Gateway     |       140000       |     20000      |    160000    |   Confirmed   |    20   |
|    410    |     448      | 2081-04-10 13:10:00 |      None     |     Mars    |    Luxury Dome Stay    | Dallas-Fort Worth Launch Complex |       150000       |     30000      |    180000    |   Confirmed   |    2    |
+-----------+--------------+---------------------+---------------+-------------+------------------------+----------------------------------+--------------------+----------------+--------------+---------------+---------+

In [32]:
%sql SELECT * FROM space_travel_agents WHERE AgentID = 1

Running query in 'sqlite:///my_database.db'

+---------+-----------+----------+-----------------------------+---------------------------+----------------------+-------------+--------------------+----------------+------------------------------+------+------------+
| AgentID | FirstName | LastName |            Email            |          JobTitle         |    DepartmentName    | ManagerName | SpaceLicenseNumber | YearsOfService | AverageCustomerServiceRating | load | agent_rank |
+---------+-----------+----------+-----------------------------+---------------------------+----------------------+-------------+--------------------+----------------+------------------------------+------+------------+
|    1    |   Aurora  |  Tanaka  | aurora.tanaka@astra2081.com | Senior Space Travel Agent | Interplanetary Sales |  Lyra Chen  |    SL-2081-001     |       12       |             4.0              |  2   |     26     |
+---------+-----------+----------+-----------------------------+---------------------------+----------------------+-------------+--------------------+----------------+------------------------------+------+------------+

In [33]:
%sql SELECT * FROM agent_rank_tracker LIMIT 5

Running query in 'sqlite:///my_database.db'

+---------+------------+
| AgentID | agent_rank |
+---------+------------+
|    1    |     26     |
|    2    |     7      |
|    3    |     2      |
|    4    |     10     |
|    5    |     23     |
+---------+------------+

In [34]:
%sql SELECT * FROM space_travel_agents WHERE load >= 2

Running query in 'sqlite:///my_database.db'

+---------+-----------+----------+-----------------------------+---------------------------+----------------------+---------------+--------------------+----------------+------------------------------+------+------------+
| AgentID | FirstName | LastName |            Email            |          JobTitle         |    DepartmentName    |  ManagerName  | SpaceLicenseNumber | YearsOfService | AverageCustomerServiceRating | load | agent_rank |
+---------+-----------+----------+-----------------------------+---------------------------+----------------------+---------------+--------------------+----------------+------------------------------+------+------------+
|    1    |   Aurora  |  Tanaka  | aurora.tanaka@astra2081.com | Senior Space Travel Agent | Interplanetary Sales |   Lyra Chen   |    SL-2081-001     |       12       |             4.0              |  2   |     26     |
|    9    |    Luna   | Martinez | luna.martinez@astra2081.com |     Space Travel Agent    |   Premium Bookings   | Zane Holloway |    SL-2081-009     |       6        |             4.4              |  2   |     28     |
|    14   |   Selene  |   Ali    |   selene.ali@astra2081.com  |  Lead Space Travel Agent  |    Luxury Voyages    | Zane Holloway |    SL-2081-014     |       16       |             4.2              |  2   |     25     |
|    15   |    Rhea   |   Chen   |   rhea.chen@astra2081.com   |     Space Travel Agent    | Interplanetary Sales |   Lyra Chen   |    SL-2081-015     |       4        |             4.1              |  2   |     29     |
|    18   |    Dax    |  Reyes   |   dax.reyes@astra2081.com   |     Space Travel Agent    |   Premium Bookings   | Zane Holloway |    SL-2081-018     |       8        |             4.0              |  2   |     27     |
|    28   |    Mila   |   Reed   |   mila.reed@astra2081.com   |     Space Travel Agent    | Interplanetary Sales |   Lyra Chen   |    SL-2081-028     |       6        |             4.9              |  3   |     30     |
+---------+-----------+----------+-----------------------------+---------------------------+----------------------+---------------+--------------------+----------------+------------------------------+------+------------+

So this trigger added the load and update the rank nicely!

## Assign agents to new customer

In [35]:
# First, create a table named new_customer

In [36]:
%%sql
CREATE TABLE new_customer (
    CustomerName VARCHAR(100) PRIMARY KEY,
    CommunicationMethod VARCHAR(50) NOT NULL CHECK (CommunicationMethod IN ('Phone Call', 'Text')),
    LeadSource VARCHAR(50) NOT NULL CHECK (LeadSource IN ('Organic', 'Bought')),
    Destination VARCHAR(50) NOT NULL CHECK (Destination IN ('Mars', 'Europa', 'Titan', 'Venus', 'Ganymede')),
    LaunchLocation VARCHAR(200) NOT NULL CHECK (LaunchLocation IN ('Dallas-Fort Worth Launch Complex', 
    'New York Orbital Gateway', 'Dubai Interplanetary Hub',
    'Tokyo Spaceport Terminal', 'London Ascension Platform', 'Sydney Stellar Port'))
    )

Running query in 'sqlite:///my_database.db'

++
||
++
++

In [37]:
%sql SELECT * FROM new_customer

Running query in 'sqlite:///my_database.db'

+--------------+---------------------+------------+-------------+----------------+
| CustomerName | CommunicationMethod | LeadSource | Destination | LaunchLocation |
+--------------+---------------------+------------+-------------+----------------+
+--------------+---------------------+------------+-------------+----------------+

In [38]:
# To make sense, I added 56 years from today

In [39]:
%%sql
CREATE TABLE agent_buffer (
  AgentID INTEGER
);

Running query in 'sqlite:///my_database.db'

++
||
++
++

In [40]:
%%sql
CREATE TRIGGER updating_customer
AFTER INSERT ON new_customer
FOR EACH ROW
BEGIN

  -- Insert assignment using buffered agent
  INSERT INTO assignment_history (
    CustomerName,
    AssignmentID,
    CommunicationMethod,
    LeadSource,
    AssignedDateTime
    --AgentID
  )
  VALUES (
    NEW.CustomerName,
    (SELECT IFNULL(MAX(AssignmentID), 0) + 1 FROM assignment_history),
    NEW.CommunicationMethod,
    NEW.LeadSource,
    datetime('now', '+56 years')
    --(SELECT AgentID FROM agent_rank_tracker)
  );

  -- Insert booking using same buffered agent
  INSERT INTO bookings_2 (
    BookingID,
    AssignmentID,
    Destination,
    LaunchLocation,
    BookingStatus
    --AgentID
  )
  VALUES (
    (SELECT IFNULL(MAX(BookingID), 0) + 1 FROM bookings_2),
    (SELECT MAX(AssignmentID) FROM assignment_history),
    NEW.Destination,
    NEW.LaunchLocation,
    'Pending'
    --(SELECT AgentID FROM agent_rank_tracker)
  );


END;

Running query in 'sqlite:///my_database.db'

++
||
++
++

In [41]:
%%sql
CREATE TRIGGER update_agent_assignment
AFTER INSERT ON assignment_history
FOR EACH ROW
BEGIN
  UPDATE assignment_history
  SET AgentID = (SELECT AgentID FROM agent_rank_tracker)
  WHERE AssignmentID = NEW.AssignmentID;
END;

Running query in 'sqlite:///my_database.db'

++
||
++
++

In [42]:
%%sql
CREATE TRIGGER update_agent_booking
AFTER INSERT ON bookings_2
FOR EACH ROW
BEGIN
  UPDATE bookings_2
  SET AgentID = (SELECT AgentID FROM agent_rank_tracker)
  WHERE BookingID = NEW.BookingID;
END;

Running query in 'sqlite:///my_database.db'

++
||
++
++

In [43]:
%sql SELECT * FROM space_travel_agents ORDER BY agent_rank LIMIT 5

Running query in 'sqlite:///my_database.db'

+---------+-----------+----------+---------------------------+---------------------------+------------------+---------------+--------------------+----------------+------------------------------+------+------------+
| AgentID | FirstName | LastName |           Email           |          JobTitle         |  DepartmentName  |  ManagerName  | SpaceLicenseNumber | YearsOfService | AverageCustomerServiceRating | load | agent_rank |
+---------+-----------+----------+---------------------------+---------------------------+------------------+---------------+--------------------+----------------+------------------------------+------+------------+
|    6    |   Soren   |  Baker   | soren.baker@astra2081.com |  Lead Space Travel Agent  | Premium Bookings | Zane Holloway |    SL-2081-006     |       18       |             4.6              |  0   |     1      |
|    3    |    Nova   |  Singh   |  nova.singh@astra2081.com | Senior Space Travel Agent | Premium Bookings | Zane Holloway |    SL-2081-003     |       15       |             4.0              |  0   |     2      |
|    27   |   Ronan   |  Young   | ronan.young@astra2081.com | Senior Space Travel Agent | Premium Bookings | Zane Holloway |    SL-2081-027     |       15       |             4.0              |  0   |     2      |
|    24   |   Phoebe  |   Diaz   | phoebe.diaz@astra2081.com | Senior Space Travel Agent | Premium Bookings | Zane Holloway |    SL-2081-024     |       13       |             4.3              |  0   |     4      |
|    16   |    Zion   |  Parker  | zion.parker@astra2081.com | Senior Space Travel Agent | Premium Bookings | Zane Holloway |    SL-2081-016     |       12       |             4.0              |  0   |     5      |
+---------+-----------+----------+---------------------------+---------------------------+------------------+---------------+--------------------+----------------+------------------------------+------+------------+

In [44]:
# Then assigning customers to an agent

In [45]:
%%sql

INSERT INTO new_customer (CustomerName, CommunicationMethod, LeadSource, Destination, LaunchLocation)
VALUES ('Kate Nguyen', 'Text', 'Organic', 'Mars', 'Dallas-Fort Worth Launch Complex'),
('Jonh Doe', 'Phone Call', 'Bought', 'Europa', 'Sydney Stellar Port')

Running query in 'sqlite:///my_database.db'

2 rows affected.

++
||
++
++

In [46]:
%sql SELECT * FROM new_customer

Running query in 'sqlite:///my_database.db'

+--------------+---------------------+------------+-------------+----------------------------------+
| CustomerName | CommunicationMethod | LeadSource | Destination |          LaunchLocation          |
+--------------+---------------------+------------+-------------+----------------------------------+
| Kate Nguyen  |         Text        |  Organic   |     Mars    | Dallas-Fort Worth Launch Complex |
|   Jonh Doe   |      Phone Call     |   Bought   |    Europa   |       Sydney Stellar Port        |
+--------------+---------------------+------------+-------------+----------------------------------+

In [47]:
%sql SELECT * FROM space_travel_agents ORDER BY agent_rank LIMIT 5

Running query in 'sqlite:///my_database.db'

+---------+-----------+----------+---------------------------+---------------------------+------------------+---------------+--------------------+----------------+------------------------------+------+------------+
| AgentID | FirstName | LastName |           Email           |          JobTitle         |  DepartmentName  |  ManagerName  | SpaceLicenseNumber | YearsOfService | AverageCustomerServiceRating | load | agent_rank |
+---------+-----------+----------+---------------------------+---------------------------+------------------+---------------+--------------------+----------------+------------------------------+------+------------+
|    6    |   Soren   |  Baker   | soren.baker@astra2081.com |  Lead Space Travel Agent  | Premium Bookings | Zane Holloway |    SL-2081-006     |       18       |             4.6              |  0   |     1      |
|    3    |    Nova   |  Singh   |  nova.singh@astra2081.com | Senior Space Travel Agent | Premium Bookings | Zane Holloway |    SL-2081-003     |       15       |             4.0              |  0   |     2      |
|    27   |   Ronan   |  Young   | ronan.young@astra2081.com | Senior Space Travel Agent | Premium Bookings | Zane Holloway |    SL-2081-027     |       15       |             4.0              |  0   |     2      |
|    24   |   Phoebe  |   Diaz   | phoebe.diaz@astra2081.com | Senior Space Travel Agent | Premium Bookings | Zane Holloway |    SL-2081-024     |       13       |             4.3              |  0   |     4      |
|    16   |    Zion   |  Parker  | zion.parker@astra2081.com | Senior Space Travel Agent | Premium Bookings | Zane Holloway |    SL-2081-016     |       12       |             4.0              |  0   |     5      |
+---------+-----------+----------+---------------------------+---------------------------+------------------+---------------+--------------------+----------------+------------------------------+------+------------+

In [48]:
%sql SELECT * FROM assignment_history ORDER BY AssignmentID DESC

Running query in 'sqlite:///my_database.db'

+--------------+---------+-----------------+---------------------+------------+---------------------+
| AssignmentID | AgentID |   CustomerName  | CommunicationMethod | LeadSource |   AssignedDateTime  |
+--------------+---------+-----------------+---------------------+------------+---------------------+
|     452      |    1    |     Jonh Doe    |      Phone Call     |   Bought   | 2081-07-10 18:58:03 |
|     451      |    1    |   Kate Nguyen   |         Text        |  Organic   | 2081-07-10 18:58:03 |
|     450      |    11   |    Mira Cruz    |      Phone Call     |   Bought   | 2081-04-10 15:00:00 |
|     449      |    20   |    Arlo King    |         Text        |  Organic   | 2081-04-10 13:50:00 |
|     448      |    2    |   Tinsley Ross  |         Text        |   Bought   | 2081-04-10 12:40:00 |
|     447      |    16   |   Elowen Bell   |      Phone Call     |  Organic   | 2081-04-10 11:30:00 |
|     446      |    24   | Callahan Rivera |         Text        |   Bought   | 2081-04-10 10:20:00 |
|     445      |    7    |   Kylan Scott   |         Text        |  Organic   | 2081-04-10 09:10:00 |
|     444      |    28   |    Zya Lewis    |      Phone Call     |   Bought   | 2081-04-09 14:55:00 |
|     443      |    13   |  Azalea Brooks  |         Text        |  Organic   | 2081-04-09 13:45:00 |
+--------------+---------+-----------------+---------------------+------------+---------------------+
Truncated to displaylimit of 10.

In [49]:
%sql SELECT * FROM space_travel_agents WHERE load > 0 ORDER BY agent_rank LIMIT 5

Running query in 'sqlite:///my_database.db'

+---------+-----------+----------+----------------------------+---------------------------+----------------------+---------------+--------------------+----------------+------------------------------+------+------------+
| AgentID | FirstName | LastName |           Email            |          JobTitle         |    DepartmentName    |  ManagerName  | SpaceLicenseNumber | YearsOfService | AverageCustomerServiceRating | load | agent_rank |
+---------+-----------+----------+----------------------------+---------------------------+----------------------+---------------+--------------------+----------------+------------------------------+------+------------+
|    22   |    Juno   |  Brooks  | juno.brooks@astra2081.com  |  Lead Space Travel Agent  |   Premium Bookings   | Zane Holloway |    SL-2081-022     |       17       |             4.8              |  1   |     17     |
|    12   |    Nia    | Ramirez  | nia.ramirez@astra2081.com  | Senior Space Travel Agent |   Premium Bookings   | Zane Holloway |    SL-2081-012     |       14       |             5.0              |  1   |     18     |
|    8    |   Orion   |  Davis   | orion.davis@astra2081.com  | Senior Space Travel Agent |    Luxury Voyages    | Zane Holloway |    SL-2081-008     |       10       |             4.4              |  1   |     19     |
|    21   |    Arlo   |  Scott   |  arlo.scott@astra2081.com  |     Space Travel Agent    | Interplanetary Sales |   Lyra Chen   |    SL-2081-021     |       7        |             4.2              |  1   |     20     |
|    13   |   Atlas   |  Foster  | atlas.foster@astra2081.com |     Space Travel Agent    | Interplanetary Sales |   Lyra Chen   |    SL-2081-013     |       6        |             4.3              |  1   |     21     |
+---------+-----------+----------+----------------------------+---------------------------+----------------------+---------------+--------------------+----------------+------------------------------+------+------------+

In [50]:
%sql SELECT * FROM bookings_2 ORDER BY BookingID DESC

Running query in 'sqlite:///my_database.db'

+-----------+--------------+---------------------+---------------------+-------------+---------------------------+----------------------------------+--------------------+----------------+--------------+---------------+---------+
| BookingID | AssignmentID | BookingCompleteDate |    CancelledDate    | Destination |          Package          |          LaunchLocation          | DestinationRevenue | PackageRevenue | TotalRevenue | BookingStatus | AgentID |
+-----------+--------------+---------------------+---------------------+-------------+---------------------------+----------------------------------+--------------------+----------------+--------------+---------------+---------+
|    503    |     452      |         None        |         None        |    Europa   |            None           |       Sydney Stellar Port        |        None        |      None      |     None     |    Pending    |    1    |
|    502    |     451      |         None        |         None        |     Mars    |            None           | Dallas-Fort Worth Launch Complex |        None        |      None      |     None     |    Pending    |    1    |
|    501    |     501      |         None        |         None        |     None    |            None           |               None               |        None        |      None      |     None     |    Pending    |    1    |
|    500    |     500      |         None        |         None        |     None    |            None           |               None               |        None        |      None      |     None     |    Pending    |    1    |
|    412    |     450      | 2081-04-10 14:25:00 |         None        |    Europa   |   Glacier Trek Adventure  |     Tokyo Spaceport Terminal     |       120000       |     25000      |    145000    |   Confirmed   |    11   |
|    411    |     449      | 2081-04-10 14:25:00 |         None        |    Titan    |      Ringside Cruise      |     New York Orbital Gateway     |       140000       |     20000      |    160000    |   Confirmed   |    20   |
|    410    |     448      | 2081-04-10 13:10:00 |         None        |     Mars    |      Luxury Dome Stay     | Dallas-Fort Worth Launch Complex |       150000       |     30000      |    180000    |   Confirmed   |    2    |
|    409    |     447      | 2081-04-10 12:00:00 |         None        |    Venus    |    Cloud City Excursion   |     Dubai Interplanetary Hub     |       130000       |     25000      |    155000    |   Confirmed   |    16   |
|    408    |     446      |         None        | 2081-04-10 10:45:00 |    Europa   | Zero-Gravity Yacht Cruise |     Tokyo Spaceport Terminal     |       120000       |     20000      |    140000    |   Cancelled   |    24   |
|    407    |     445      | 2081-04-10 09:30:00 |         None        |    Titan    |      Ringside Cruise      |     New York Orbital Gateway     |       140000       |     25000      |    165000    |   Confirmed   |    7    |
+-----------+--------------+---------------------+---------------------+-------------+---------------------------+----------------------------------+--------------------+----------------+--------------+---------------+---------+
Truncated to displaylimit of 10.

## Close cursor and connection

In [51]:
cursor.close()
conn.close()